# UDEMY MySQL Bootcamp Course

Completed Section 1 of Course May 20th, 2021

Signed up for GOORM IDE and created new workspace for course May 23, 2021

Completed Section 2 of Course May 23, 2021

Completed Lecture Videos Section 3 # 17-26 May 23, 2021

Lecture 27 - Basic Data Types Challenge
    Draw a Tweets Table
        - A username (max 15 characters)
        - The Tweet Content (max 140 characters)
        - Number of Favorites
    My_Tweet_Table
        - username varchar(15)
        - Content varchar(140)
        - Favorites int
    Solution
        - username varchar(15)
        - Content varchar(140)
        - Favorites int
    Challege is Correct
    Challenge Completed May 23, 2021

Completed Lecture Videos Section 3 # 29-34 May 23, 2021

Lecture 35 - Creating Your Own Tables Challenge
    Pastries Table
        - Should atleast include columns name (50 characters max) and quantity
        - Inspect your table/columsn in cli
        - Delete the table

In [1]:
# Lecture 35 Challenge
# CREATE TABLE pastries(
#    -> name VARCHAR(50),
#    -> number INT,
#    -> price INT
#    -> );
# SHOW TABLES;
# SHOW COLUMNS FROM pastries;
# DROP TABLE pastries;
# SHOW TABLES;

In [2]:
# Lecture 35 Solution
# CREATE TABLE pastries
#   (
#     name VARCHAR(50),
#     quantity INT
#   );
 
# SHOW TABLES;
 
# DESC pastries;
 
# DROP TABLE pastries;
# Slight syntax difference between work and solution. Still correct.
# Completed Lecture 35 Code Challenge May 23, 2021

Completed Section 3 May 23, 2021

Completed Lecture Videos Section 4 # 37-43 May 25th, 2021

In [1]:
# Lecture 44 Challenge
# CREATE TABLE people (
#    -> first_name VARCHAR(20),
#    -> last_name VARCHAR(20),
#    -> age INT
#    -> );
#
# INSERT INTO people(first_name, last_name, age) VALUES('Tina', 'Belcher', 13);
# SELECT * FROM people;
#
# INSERT INTO people(age, first_name, last_name) VALUES (42, 'Bob', 'Belcher');
# SELECT * FROM people;
#
# INSERT INTO people(first_name, last_name, age) VALUES ('Linda', 'Belcher', 45), ('Phillip', 'Frond', 38), ('Calvin', 'F
# ischoeder', 70);
# SELECT * FROM people;

In [2]:
# INSERT CHALLENGE SOLUTION
# CREATE TABLE people
#   (
#     first_name VARCHAR(20),
#     last_name VARCHAR(20),
#     age INT
#   );
# INSERT INTO people(first_name, last_name, age)
# VALUES ('Tina', 'Belcher', 13);
# INSERT INTO people(age, last_name, first_name)
# VALUES (42, 'Belcher', 'Bob');
# INSERT INTO people(first_name, last_name, age)
# VALUES('Linda', 'Belcher', 45)
#   ,('Phillip', 'Frond', 38)
#   ,('Calvin', 'Fischoeder', 70);
# Slight Difference between work and solution. Still correct.
# Completed Lecture 44 Code Challenge May 28, 2021

Completes Lecture Videos Section 4 # 48 - 56 May 29, 2021

In [1]:
# Lecture 57 CHALLENGE
# CREATE TABLE Employees(
#     -> id INT NOT NULL AUTO_INCREMENT,
#     -> last_name VARCHAR(20) NOT NULL,
#     -> first_name VARCHAR(20) NOT NULL,
#     -> middle_name VARCHAR(20),
#     -> age INT NOT NULL,
#     -> current_status VARCHAR(50) NOT NULL DEFAULT 'employed',
#     -> PRIMARY KEY (id)
#     -> );
#
# INSERT INTO Employees(last_name, first_name, middle_name, age, current_status) VALUES ('Smith', 'John', 'William', 23,
# 'employed')

In [2]:
# Lecture 57 SOLUTION
# CREATE TABLE employees (
#     id INT AUTO_INCREMENT NOT NULL,
#     first_name VARCHAR(255) NOT NULL,
#     last_name VARCHAR(255) NOT NULL,
#     middle_name VARCHAR(255),
#     age INT NOT NULL,
#     current_status VARCHAR(255) NOT NULL DEFAULT 'employed',
#     PRIMARY KEY(id)
# );
#
# Slight Difference in order of words between work and solution. Still Correct.
# Completed May 30th, 2021

Completed Section 4 May 30, 2021

Completed Video Lectures Section 5 # 60-68

In [1]:
# Lecture 69 CHALLENGE
#
# SELECT cat_id FROM cats;
#
# SELECT name, breed FROM cats;
#
# SELECT name, age FROM cats
#    -> WHERE breed = 'Tabby';
#
# SELECT cat_id, age FROM cats
#     -> WHERE cat_id = age;

In [2]:
# Lecture 69 SOLUTION
# SELECT cat_id FROM cats; 

# SELECT name, breed FROM cats; 

# SELECT name, age FROM cats WHERE breed='Tabby'; 

# SELECT cat_id, age FROM cats WHERE cat_id=age; 

# SELECT * FROM cats WHERE cat_id=age; 

# Work is correct. Completed May 31, 2021

Completes Video Lectures Section 5 # 72 - 75

In [1]:
# Lecture 76 CHALLENGE

# UPDATE cats SET name = 'Jack'
#    -> WHERE name = 'Jackson';

# UPDATE cats SET breed = 'British Shorthair'
# -> WHERE name = 'Ringo';

# UPDATE cats SET age = 12
#    -> WHERE breed = 'Maine Coon';

In [2]:
# Lecture 76 SOLUTION

# SELECT * FROM cats WHERE name='Jackson';
 
### UPDATE cats SET name='Jack' WHERE name='Jackson';
 
# SELECT * FROM cats WHERE name='Jackson';
 
# SELECT * FROM cats WHERE name='Jack';
 
# SELECT * FROM cats WHERE name='Ringo';
 
### UPDATE cats SET breed='British Shorthair' WHERE name='Ringo';
 
# SELECT * FROM cats WHERE name='Ringo';
 
# SELECT * FROM cats;

# SELECT * FROM cats WHERE breed='Maine Coon';
 
### UPDATE cats SET age=12 WHERE breed='Maine Coon';
 
# SELECT * FROM cats WHERE breed='Maine Coon';

# Work is correct. Completed May 31, 2021

Completes Video Lecture 79-80

In [1]:
# Lecture 81 CODE CHALLENGE
# 
# DELETE FROM cats WHERE age = 4;
#
# DELETE FROM cats where cat_id = age;
#
# DELETE FROM cats;

In [2]:
# Lecture 81 CODE SOLUTION

# SELECT * FROM cats WHERE age=4;
 
# DELETE FROM cats WHERE age=4;
 
# SELECT * FROM cats WHERE age=4;
 
# SELECT * FROM cats;
 
# SELECT *  FROM cats WHERE cat_id=age;
 
# DELETE FROM cats WHERE cat_id=age;
 
# DELETE FROM cats;
 
# SELECT * FROM cats;

# Work is correct. Completed June 5th, 2021

COMPLETED SECTION 5 June 5th, 2021

Completes Video Lecture 84

In [1]:
# SECTION 6 CRUD Exercises
# CREATE EXERCISE

# CREATE DATABASE shirts_db;

# USE shirts_db;

# CREATE TABLE shirts (
#     -> shirt_id INT NOT NULL AUTO_INCREMENT PRIMARY KEY,
#     -> article VARCHAR(50),
#     -> color VARCHAR(50),
#     -> shirt_size VARCHAR(10),
#     -> last_worn INT
#     -> );

# INSERT INTO shirts (article, color, shirt_size, last_worn) VALUES
#     -> ('t-shirt', 'white', 'S', 10),
#     -> ('t-shirt', 'green', 'S', 200),
#     -> ('polo shirt', 'black', 'M', 10),
#     -> ('tank top', 'blue', 'S', 50),
#     -> ('t-shirt', 'pink', 'S', 0),
#     -> ('polo shirt', 'red', 'M', 5),
#     -> ('tank top', 'white', 'S', 200),
#     -> ('tank top', 'blue', 'M', 15);

# INSERT INTO shirts (article, color, shirt_size, last_worn) VALUES ('polo shirt', 'purple', 'M', 50);

In [2]:
# SECTION 6 CRUD Exercises
# CREATE EXERCISE SOLUTION

# SELECT database();
 
# CREATE DATABASE shirts_db;
 
# use shirts_db;
 
# SELECT database();
 
# CREATE TABLE shirts
#   (
#     shirt_id INT NOT NULL AUTO_INCREMENT,
#     article VARCHAR(100),
#     color VARCHAR(100),
#     shirt_size VARCHAR(100),
#     last_worn INT,
#     PRIMARY KEY(shirt_id)
#   );
 
# DESC shirts;
 
# INSERT INTO shirts(article, color, shirt_size, last_worn) VALUES
# ('t-shirt', 'white', 'S', 10),
# ('t-shirt', 'green', 'S', 200),
# ('polo shirt', 'black', 'M', 10),
# ('tank top', 'blue', 'S', 50),
# ('t-shirt', 'pink', 'S', 0),
# ('polo shirt', 'red', 'M', 5),
# ('tank top', 'white', 'S', 200),
# ('tank top', 'blue', 'M', 15);
 
# SELECT * FROM shirts;
 
# INSERT INTO shirts(color, article, shirt_size, last_worn) 
# VALUES('purple', 'polo shirt', 'medium', 50);
 
# SELECT * FROM shirts;

# Work is correct. Completed June 5, 2021

In [1]:
# SECTION 6 CRUD Exercises
# READ EXERCISE

# SELECT article, color FROM shirts;

# SELECT article, color, shirt_size, last_worn FROM shirts WHERE shirt_size = 'M';

In [2]:
# SECTION 6 CRUD Exercises
# READ EXERCISE SOLUTION

# SELECT article, color FROM shirts;
 
# SELECT * FROM shirts WHERE shirt_size='M';
 
# SELECT article, color, shirt_size, last_worn FROM shirts WHERE shirt_size='M';

# Work is correct. Completed June 5, 2021

In [1]:
# SECTION 6 CRUD Exercises
# UPDATE EXERCISE

# PROBLEM: UPDATE all polo shirts, change their size to L
# UPDATE shirts SET shirt_size = 'L' WHERE article = 'polo shirt';
# SELECT * FROM shirts;

# PROBLEM: UPDATE shirt last worn 15 days ago, change last_worn to 0
# UPDATE shirts SET last_worn = 0 WHERE last_worn = 15;
# SELECT * FROM shirts;

# PROBLEM: UPDATE all white shirts, change size to 'XS' and color to 'off white'
# UPDATE shirts SET shirt_size = 'XS', color = 'off white' WHERE color = 'white';
# SELECT * FROM shirts;

In [2]:
# SECTION 6 CRUD EXERCISES
# UPDATE EXERCISE SOLUTION

# SELECT * FROM shirts WHERE article='polo shirt';
 
# UPDATE shirts SET shirt_size='L' WHERE article='polo shirt';
 
# SELECT * FROM shirts WHERE article='polo shirt';
 
# SELECT * FROM shirts;
 
# SELECT * FROM shirts WHERE last_worn=15;
 
# UPDATE shirts SET last_worn=0 WHERE last_worn=15;
 
# SELECT * FROM shirts WHERE last_worn=15;
 
# SELECT * FROM shirts WHERE last_worn=0;
 
# SELECT * FROM shirts WHERE color='white';
 
# UPDATE shirts SET color='off white', shirt_size='XS' WHERE color='white';
 
# SELECT * FROM shirts WHERE color='white';
 
# SELECT * FROM shirts WHERE color='off white';
 
# SELECT * FROM shirts;

# Solution is slightly different when checking the values being changed. The work itself is still correct.
# Completed June 12, 2021

In [1]:
# SECTION 6 CRUD EXERCISES
# DELETE EXERCISE

# PROBLEM: Delete all old shirts, where last_worn = 200
# DELETE FROM shirts WHERE last_worn = 200;
# SELECT * FROM shirts;

# PROBLEM: Delete all tank tops
# DELETE FROM shirts WHERE article = 'tank top';
# SELECT * FROM shirts;

# PROBLEM: Delete all shirts
# DELETE FROM shirts;
# SELECT * FROM shirts;

# PROBLEM: Drop the entire shirts table
# DROP TABLE shirts;
# SHOW TABLES;

In [2]:
# SECTION 6 CRUD EXERCISES
# DELETE EXERCISE SOLUTION

# SELECT * FROM shirts;
 
# SELECT * FROM shirts WHERE last_worn=200;
 
# DELETE FROM shirts WHERE last_worn=200;
 
# SELECT * FROM shirts WHERE article='tank top';
 
# DELETE FROM shirts WHERE article='tank top';
 
# SELECT * FROM shirts WHERE article='tank top';
 
# SELECT * FROM shirts;
 
# DELETE FROM shirts;
 
# SELECT * FROM shirts;
 
# DROP TABLE shirts;
 
# show tables;
 
# DESC shirts;

# WORK IS CORRECT. COMPLETED June 12, 2021

Completes Section 6 June 12, 2021

Completes Video Lectures 94 - 99 June 12, 2021

Completes Video Lectures 100 - 112 June 13, 2021

In [1]:
# Code Challenge from Lecture 113

# Reverse and uppercase the following sentence: Why does my cat look at me with such hatred?
# SELECT REVERSE(UPPER('Why does my cat look at me with such hatred?'));

# What does the following return, without testing it:
# SELECT REPLACE(CONCAT('I', ' ', 'like', ' ', 'cats'), ' ', '-');
# "I-like-cats"

# Replaces spaces in titles with '->'
# SELECT REPLACE(title, ' ', '->') AS 'title' FROM books;

# Print out column with last_name forward and a column with it backwards
# SELECT author_lname AS 'forwards', REVERSE(author_lname) AS 'backwards' FROM books;

# Print Full Name in CAPS
# SELECT UPPER(CONCAT(author_fname, ' ', author_lname)) AS 'full name in caps' FROM books;

# Print a blurb with the title and when it was released
# SELECT CONCAT(title, ' was released in ', released_year) AS 'blurb' FROM books;

# Print book titles and the length of the titles
# SELECT title, CHAR_LENGTH(title) AS 'character count' FROM books;

# Print short title, author, and number in stock
# SELECT CONCAT(SUBSTRING(title, 1, 10), '...') AS 'short title',
#     -> CONCAT(author_lname, ', ', author_fname) AS 'author',
#     -> CONCAT(stock_quantity, ' in stock') AS 'quantity'
#     -> FROM books;

In [2]:
# CODE CHALLENGE SOLUTION

# SELECT UPPER(REVERSE('Why does my cat look at me with such hatred?')); 
# OR
# SELECT REVERSE(UPPER('Why does my cat look at me with such hatred?'));

# SELECT REPLACE(CONCAT('I', ' ', 'like', ' ', 'cats'), ' ', '-'); 

# SELECT REPLACE(title, ' ', '->') AS title FROM books; 

# SELECT 
#    author_lname AS forwards,
#    REVERSE(author_lname) AS backwards 
# FROM books;


# SELECT
#    UPPER
#    (
#       CONCAT(author_fname, ' ', author_lname)
#    ) AS 'full name in caps'
# FROM books;

# SELECT
#    CONCAT(title, ' was released in ', released_year) AS blurb
# FROM books;

# SELECT
#    title,
#    CHAR_LENGTH(title) AS 'character count'
# FROM books;

# SELECT
#    CONCAT(SUBSTRING(title, 1, 10), '...') AS 'short title',
#    CONCAT(author_lname, ',', author_fname) AS author,
#    CONCAT(stock_quantity, ' in stock') AS quantity
# FROM books;

# Work is correct. Completed Jan 13, 2021

Completed Section 7

Completed Section 8 Video Lectures # 116 - 128 June 16, 2021

In [1]:
# SECTION 8 CODE CHALLENGE (LECTURE 130)

# SELECT title from books WHERE title LIKE '%stories%';

# SELECT title, pages from books ORDER BY pages DESC LIMIT 1;

# SELECT CONCAT(title, ' - ', released_year) AS summary FROM books ORDER BY released_year DESC LIMIT 3;

# SELECT title, author_lname FROM books WHERE author_lname LIKE '% %';

# SELECT title, released_year, stock_quantity FROM books ORDER BY stock_quantity, title LIMIT 3;

# SELECT title, author_lname FROM books ORDER BY author_lname, title;

# SELECT CONCAT('MY FAVORITE AUTHOR IS ', UPPER(author_fname), ' ', UPPER(author_lname), '!') AS 'yell' FROM books ORDER BY author_lname;

In [2]:
# SECTION 8 CODE CHALLENGE SOLUTION (LECTURE 131&132)

# SELECT title FROM books WHERE title LIKE '%stories%';
 
# SELECT title, pages FROM books ORDER BY pages DESC LIMIT 1;
 
# SELECT 
#     CONCAT(title, ' - ', released_year) AS summary 
# FROM books ORDER BY released_year DESC LIMIT 3;
 
# SELECT title, author_lname FROM books WHERE author_lname LIKE '% %';
 
# SELECT title, released_year, stock_quantity 
# FROM books ORDER BY stock_quantity LIMIT 3;
 
# SELECT title, author_lname 
# FROM books ORDER BY author_lname, title;
 
# SELECT title, author_lname 
# FROM books ORDER BY 2,1;
 
# SELECT
#     CONCAT(
#         'MY FAVORITE AUTHOR IS ',
#         UPPER(author_fname),
#         ' ',
#         UPPER(author_lname),
#         '!'
#     ) AS yell
# FROM books ORDER BY author_lname;

# WORK IS CORRECT! COMPLETED JUNE 16, 2021

Completed Section 8 June 16, 2021

Completed Section 9 Lecture Videos # 132 - 147 June 16, 2021

In [1]:
# SECTION 8 CODE CHALLENGE (LECTURE 148)

# SELECT COUNT(*) FROM books;

# SELECT released_year, COUNT(*) FROM books GROUP BY released_year;

# SELECT SUM(stock_quantity) FROM books;

# SELECT author_fname, author_lname, AVG(released_year) FROM books ORDER BY author_lname, author_fname;

# SELECT CONCAT(author_fname, ' ', author_lname) AS 'Full Name', pages FROM books ORDER BY pages DESC LIMIT 1;

# SELECT released_year AS year, COUNT(*) AS '# of books', AVG(pages) AS 'avg pages' FROM books GROUP BY released_year;

In [2]:
# SECTION 8 CODE CHALLENGE SOLUTION (LECTURE 149-150)

# SELECT COUNT(*) FROM books;
 
# SELECT COUNT(*) FROM books GROUP BY released_year;
 
# SELECT released_year, COUNT(*) FROM books GROUP BY released_year;
 
# SELECT Sum(stock_quantity) FROM BOOKS;
 
# SELECT AVG(released_year) FROM books GROUP BY author_lname, author_fname;
 
# SELECT author_fname, author_lname, AVG(released_year) FROM books GROUP BY author_lname, author_fname;
 
# SELECT CONCAT(author_fname, ' ', author_lname) FROM books
# WHERE pages = (SELECT Max(pages) FROM books);
 
# SELECT CONCAT(author_fname, ' ', author_lname) FROM books
# ORDER BY pages DESC LIMIT 1;
 
# SELECT pages, CONCAT(author_fname, ' ', author_lname) FROM books
# ORDER BY pages DESC;
 
# SELECT released_year AS year,
#     COUNT(*) AS '# of books',
#     AVG(pages) AS 'avg pages'
# FROM books
#     GROUP BY released_year;

# WORK IS CORRECT. COMPLETED JUNE 16, 2021

COMPLETED SECTION 9. JUNE 16, 2021

COMPLETED SECTION 10 VIDEO LECTURES 151 - 170 June 20, 2021

In [1]:
# SECTION 10 CODE CHALLENGE (LECTURE 171)

# When is a good use case for CHAR?
# If you have a column for States. Each State has a two letter abbreviation and CHAR(2) can be used without wasting memory

# Fill in the blanks
#.   VARCHAR
#.   DECIMAL(8, 2)
#.   INT

# What is the difference between datatime and timestamp?
#    The major difference between the two is that timestamp converts the time to UTC and when queried, it will
#    convert from UTC to the current time zone, which is useful for companies that may work in multiple time zones
#    Tmestamp also will only work during a certain set of years, which is shorted than datetime.

# Print out the current time.
#    SELECT CURTIME()

# Print out the current date.
#    SELECT CURDATE()

# Print out the current day of the week (the number).
#.   SELECT DAYOFWEEK(CURDATE())

# Print out the current day of the week (the day name).
#    SELECT DAYNAME(CURDATE())

# Print out the current day and time using this format: mm/dd/yyyy
#    SELECT DATE_FORMAT(CURDATE(), '%m/%d/%Y')

# Print out the current day and time using this format: January 2nd at 3:15, April 1st at 10:18
#    SELECT DATE_FORMAT(NOW(), '%M %D at %h:%i')

# CREATE TABLE tweets (content VARCHAR(140), username VARCHAR(20), time TIMESTAMP DEFAULT NOW())

In [2]:
# SECTION 10 CODE CHALLENGE SOLUTION (LECTURE 172 - 173)

# What's a good use case for CHAR?
# ------
# Used for text that we know has a fixed length, e.g., State abbreviations, 
# abbreviated company names, sex M/F, etc.
 
# CREATE TABLE inventory (
#     item_name VARCHAR(100),
#     price DECIMAL(8,2),
#     quantity INT
# );
 
# What's the difference between DATETIME and TIMESTAMP?
# ------
# They both store datetime information, but there's a difference in the range, 
# TIMESTAMP has a smaller range. TIMESTAMP also takes up less space. 
# TIMESTAMP is used for things like meta-data about when something is created
# or updated.
 
# SELECT CURTIME();
 
# SELECT CURDATE()';
 
# SELECT DAYOFWEEK(CURDATE());
# SELECT DAYOFWEEK(NOW());
# SELECT DATE_FORMAT(NOW(), '%w') + 1;
 
# SELECT DAYNAME(NOW());
# SELECT DATE_FORMAT(NOW(), '%W');
 
# SELECT DATE_FORMAT(CURDATE(), '%m/%d/%Y');
 
# SELECT DATE_FORMAT(NOW(), '%M %D at %h:%i');
 
# CREATE TABLE tweets(
#     content VARCHAR(140),
#     username VARCHAR(20),
#     created_at TIMESTAMP DEFAULT NOW()
# );
 
# INSERT INTO tweets (content, username) VALUES('this is my first tweet', 'coltscat');
# SELECT * FROM tweets;
 
# INSERT INTO tweets (content, username) VALUES('this is my second tweet', 'coltscat');
# SELECT * FROM tweets;

# Work is correct. COMPLETED June 26th, 2021

COMPLETED SECTION 10 JUNE 26th, 2021

COMPLETED VIDEO LECTURES 174 - 184 JUNE 26th, 2021

COMPLETED VIDEO LECTURES 185-192 JUNE 26th, 2021

In [1]:
# SECTION 11 CODE CHALLENGE (LECTURE 193)

# Evaluate the following...

# SELECT 10 != 10; Will Return 0 (FALSE)
# SELECT 15 > 14 && 99 - 5 <= 94; Will return 1 (TRUE)
# SELECT 1 IN (5,3) || 9 BETWEEN 8 AND 10; Will return 1 (TRUE)

# Select All Books Written Before 1980 (non inclusive)
# SELECT * FROM books WHERE released_year < 1980;

# Select All Books Written By Eggers Or Chabon
# SELECT * FROM books WHERE author_lname IN ('EGGERS', 'CHABON');

# Select All Books Written By Lahiri, Published after 2000
# SELECT * FROM books WHERE author_lname = 'Lahiri' AND released_year > 2000;

# Select All books with page counts between 100 and 200
# SELECT * FROM books WHERE pages BETWEEN 100 AND 200;

# Select all books where author_lname  starts with a 'C' or an 'S''
# SELECT * FROM books WHERE author_lname LIKE 'C%' OR author_lname LIKE 'S%';

# If title contains 'stories'   -> Short Stories, Just Kids and A Heartbreaking Work  -> Memoir, Everything Else -> Novel
# SELECT title, author_lname, 
#    -> CASE 
#        -> WHEN title LIKE '%stories%' THEN 'Short Stories'
#        -> WHEN title LIKE '%Just KIDS%' OR title LIKE '%A Heartbreaking Work%' THEN 'Memoir'
#        -> ELSE 'Novel'
#    -> END AS 'Type'
# -> FROM books;

# Bonus: Make This Happen
# SELECT author_lname, CASE
#     -> WHEN COUNT(*) = 1 THEN CONCAT(COUNT(*), ' book')
#     -> ELSE CONCAT(COUNT(*), ' books')
#     -> END AS COUNT
#     -> FROM books
#     -> GROUP BY author_lname, author_fname;

In [2]:
# SECTION 11 CODE CHALLENGE SOLUTION (LECTURE 194-195)

# SELECT 10 != 10;
# -- false
 
# SELECT 15 > 14 && 99 - 5 <= 94;
# -- true
 
# SELECT 1 IN (5,3) || 9 BETWEEN 8 AND 10;
# -- true
 
# SELECT title, released_year FROM books WHERE released_year < 1980;
 
# SELECT title, author_lname FROM books WHERE author_lname='Eggers' OR author_lname='Chabon';
 
# SELECT title, author_lname FROM books WHERE author_lname IN ('Eggers','Chabon'); (USED THIS VERSION)
 
# SELECT title, author_lname, released_year FROM books WHERE author_lname = 'Lahiri' && released_year > 2000;
 
# SELECT title, pages FROM books WHERE pages >= 100 && pages <=200;
 
# SELECT title, pages FROM books WHERE pages BETWEEN 100 AND 200; (USED THIS VERSION)
 
# SELECT 
#     title, 
#     author_lname 
# FROM books 
# WHERE 
#     author_lname LIKE 'C%' OR 
#     author_lname LIKE 'S%'; (USED THIS VERSION)
 
# SELECT 
#     title, 
#     author_lname 
# FROM books 
# WHERE 
#     SUBSTR(author_lname,1,1) = 'C' OR 
#     SUBSTR(author_lname,1,1) = 'S';
 
# SELECT title, author_lname FROM books 
# WHERE SUBSTR(author_lname,1,1) IN ('C', 'S');
 
# SELECT 
#     title, 
#     author_lname,
#     CASE
#         WHEN title LIKE '%stories%' THEN 'Short Stories'
#         WHEN title = 'Just Kids' OR title = 'A Heartbreaking Work of Staggering Genius' THEN 'Memoir'
#         ELSE 'Novel'
#     END AS TYPE
# FROM books; (USED LIKE STATEMENT INSTEAD OF = SO THAT SECOND NOVEL DID NOT HAVE TO BE WRITTEN OUT COMPLETELY)
 
# SELECT author_fname, author_lname,
#     CASE 
#         WHEN COUNT(*) = 1 THEN '1 book'
#         ELSE CONCAT(COUNT(*), ' books')
#     END AS COUNT
# FROM books 
# GROUP BY author_lname, author_fname; (THE FIRST CASE IS HARD CODED, I USED CONCAT FOR BOTH)

# SMALL DIFFERENCES IN SYNTAX, BUT ALL CODING CHALLENGES HAVE THE CORRECT RESULT
# COMPLETED JUNE 27TH, 2021

COMPLETED SECTION 11 JUNE 27TH, 2021